#Код Морзе для представления цифр и букв использует тире и точки. Напишите
#функцию для кодирования текстового сообщения в соответствии с кодом Морзе.
#(словари в помощь)

morz = {'a': '•—', 'b': '—•••', 'c': '—•—•', 'd': '—••',
         'e': '•', 'f': '••-•', 'g': '--•', 'h': '••••',
         'i': '••', 'j': '•---', 'k': '-•-', 'l': '•-••',
         'm': '--', 'n': '-•', 'o': '---', 'p': '•--•',
         'q': '--•-', 'r': '•-•', 's': '•••', 't': '-',
         'u': '••-', 'v': '•••-', 'w': '•--', 'x': '-••-',
         'y': '-•--', 'z': '——••', '0': '-----', '1': '.----',
         '2': '..---', '3': '...--', '4': '....-', '5': '.....',
         '6': '-....', '7': '--...', '8': '---..', '9': '----.'}

def str_to_morz(st: str):
    result = []
    for ind in range(0, len(st)):
            result.append(str(morz[st[ind]]))
    return result

stri = input('Напишите текст: ')
try:
    print(f'Это текст в соответствии с кодом Морзе выглядит так \n{str_to_morz(stri)}')
except:
    print('В коде Морзе нет таких Букв')


